app/controllers/home_controller.rb

  def index
    @identities = Identity.all
---
SELECT "identities".* FROM "identities"