app/controllers/identities_controller.rb

SELECT "identities".* FROM "identities"
---
  def index
    @identities = Identity.all

INSERT INTO "identities" ("name", "enrollment_id", "lecture", "expiration", "campus", "user_name", "user_id", "last_printed", "avatar_file_name", "avatar_content_type", "avatar_file_size", "avatar_updated_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @identity = Identity.new(identity_params)
    @identity.user_name = current_user.name
    @identity.avatar = File.new(upload_path)
   respond_to do |format|
     if @identity.save

UPDATE "identities" SET "expiration" = ?, "user_name" = ?, "user_id" = ?, "last_printed" = ?, "updated_at" = ? WHERE "identities"."id" = ?  [["expiration", ""], ["user_name", ""], ["user_id", ""], ["last_printed", ""], ["updated_at", "2015-03-09 22:53:58.349661"], ["id", 29]]
---
  def update
    respond_to do |format|
      if @identity.update(identity_params)

DELETE FROM "identities" WHERE "identities"."id" = ?  [["id", 1]]
---
  def destroy
    @identity.destroy

SELECT  "identities".* FROM "identities" WHERE "identities"."id" = ? LIMIT 1  [["id", nil]]
---
    def set_identity
      @identity = Identity.find(params[:id])